#include <iostream>
using namespace std;
int main()
{
	//在c++中显示true, false
	cout << boolalpha;
	cout << "16<99么？" << (16<99) << endl; 
	cout << "18>99么？" << (18>99) << endl;
	//位运算符
	//按位与‘&’,按位或‘|’，按位非‘~’，按位异或‘^’，左移‘<<’，右移‘>>’ 
	 
	int num=4&5;
	//按位与是两个数都转换为二进制，然后一位上都是1才为1，有一个不为1就是0
	//4=100,5=101,结果是100=4; 
	cout << num << endl;
	int num2=4|5;
	cout << num2 << endl; 
	//按位或是两个数都转换为二进制，然后一位上有一个是1就是1；
	//4=100，5=101，结果是101=5 
	int num1=~2;
	//按位非是二进制八位(00000010)取反，0->1,1->0，变为负数二进制(11111101) 
	//负数二进制转化为十进制，就是将二进制再取反(00000010)然后+1(00000011)结果再取负=-3 
	cout << num1 << endl;
	int num3=4^5;
	//按位异或，两个数转换为二进制，一个位上的两个数相同则为0，不同则为1 
	//4=100，5=101，结果是001=1 
	cout << num2 << endl;
	int num4=2<<3;//两边都是数字 
	//右移或右移，要区分cout中的情况，cout中的插入运算符进行了运算符重载 
	//左移是把左边的数字转换为二进制然后左移三位
	//2=10,左移三位变为10000=2^4=16 
	cout << num4 << endl;
	/*运算符月优先级*/
	/*1、单目运算符(! ~ ++ -- sizeof) 
	* 2、！ 
	* 3、算数运算符 
	* 4、关系运算符 
	* 5、&& 
	* 6、|| 
	* 7、赋值运算符 
	*/
	/*三元运算符*/
	int num6=5>6?10:12;
	cout << num6 << endl;  
} 
